testCase circular/system/nProc
nX     2;
nZ     1;
