testCase circular/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                |                                                  |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox            |
|  \    /   O peration     | Version:  2.1.x                                  |
|   \  /    A nd           | Web:      www.OpenFOAM.org                       |
|    \/     M anipulation  |                                                  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *//

type surfaces;  
setFormat raw;

surfaceFormat foam;
formatOptions
{
    ensight
    {
	format  ascii;
    }
}
 
interpolationScheme cell;
 
fields
(
    M0 M1 M2 M3 M4
);
 
surfaces
(
      section
      {
	type        cuttingPlane;
	planeType   pointAndNormal;
	point       (0 -0.0395 0);
	normal      (0 1 0);
      }
 
);
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *//


